stubs/libxml2/samples/dfd6d8e0015c7fa18704885f3ef1b665fc7bd237

<?xml version="1.0" encoding="UTF-8"?>
<l:log xmlns:l="http://www.w3.org/2002/ws/addressing/logs/">
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1100" timestamp="2006-03-06T22:13:18.936" conversation="1" wsi-log303:ID="1" type="request" message="1">
    <l:content><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:5053/interop/services/wsaTest</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:87cdc91d-dc25-49d5-b39b-c713dcc27ac7</MessageID><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1100</notify></S:Body></S:Envelope></l:content>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1904</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">webservices.sonicsw.com:8080</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">POST /interop/services/wsaTest HTTP/1.1&#13;
SOAPAction: http://example.org/action/notify&#13;
Content-Type: text/xml&#13;
User-Agent: Java/1.5.0_02&#13;
Host: localhost:5053&#13;
Accept: text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2&#13;
Connection: keep-alive&#13;
Content-Length: 535&#13;
&#13;
</httpHeaders>
  </l:message>
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1100" timestamp="2006-03-06T22:13:19.347" conversation="1" wsi-log303:ID="2" type="response" message="2">
    <l:content/>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">webservices.sonicsw.com:8080</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1904</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">HTTP/1.1 202 Accepted&#13;
Content-Length: 0&#13;
Date: Tue, 07 Mar 2006 05:58:22 GMT&#13;
Server: Apache-Coyote/1.1&#13;
&#13;
</httpHeaders>
  </l:message>
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1101" timestamp="2006-03-06T22:13:19.457" conversation="1" wsi-log303:ID="3" type="request" message="1">
    <l:content><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:5053/interop/services/wsaTest</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:477bf8a1-b6e7-4267-9d9e-ae802177cdce</MessageID><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1101</notify></S:Body></S:Envelope></l:content>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1904</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">webservices.sonicsw.com:8080</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">POST /interop/services/wsaTest HTTP/1.1&#13;
SOAPAction: http://example.org/action/notify&#13;
Content-Type: text/xml&#13;
User-Agent: Java/1.5.0_02&#13;
Host: localhost:5053&#13;
Accept: text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2&#13;
Connection: keep-alive&#13;
Content-Length: 535&#13;
&#13;
</httpHeaders>
  </l:message>
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1101" timestamp="2006-03-06T22:1